/**
プログラミング実践Java
オブジェクト指向
練習問題4_3
練習問題4_2のプログラムに対して、以下の修正をしてください。
  新しい学生を追加する
    鈴木：吹奏楽部：社会

コンパイル方法
================
>>> javac SO302_Ex01_Q4_3.java
================

実行例
================
>>> java SO302_Ex01_Q4_3
私の名前は山田です。
A高校の野球部に入っています。
私の好きな教科は国語です。

私の名前は田中です。
A高校のテニス部に入っています。
私の好きな教科は数学です。

私の名前は鈴木です。
A高校の吹奏楽部に入っています。
私の好きな教科は社会です。

私の名前は山田です。
B高校の野球部に入っています。
私の好きな教科は国語です。

私の名前は田中です。
B高校のテニス部に入っています。
私の好きな教科は数学です。

私の名前は鈴木です。
B高校の吹奏楽部に入っています。
私の好きな教科は社会です。

================

*/


// ここより下に解答を記載する。
