/**
プログラミング実践Java
オブジェクト指向
演習課題 問2-1

コンパイル方法
================
>>> javac SO302_Ex03.java
================

実行例
================
>>> java SO302_Ex03
書店情報
  書店名  ：B書店
  住所    ：東京都中央区1-2-3
  電話番号：03-1234-5678

書籍情報
  書名    ：Java入門
  価格    ：2000円
  著者    ：山田太郎
  出版社  ：C出版

書籍情報
  書名    ：Java実践
  価格    ：2200円
  著者    ：山田太郎
  出版社  ：C出版

書籍情報
  書名    ：マンガで分かるJava（1巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

書籍情報
  書名    ：マンガで分かるJava（2巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

書籍情報
  書名    ：マンガで分かるJava（3巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

書籍情報
  書名    ：Javaマガジン
  価格    ：1000円
  著者    ：佐藤次郎
  出版社  ：Eブックス
  ジャンル：趣味
  発売日  ：2021/12/24

書籍情報
  書名    ：Javaマガジン
  価格    ：1000円
  著者    ：佐藤次郎
  出版社  ：Eブックス
  ジャンル：趣味
  発売日  ：2022/03/24

================

*/


// ここより下に解答を記載する。
