/**
プログラミング実践Java
オブジェクト指向
練習問題4_4 学生ごとに教科書を持たせる
練習問題4_3のプログラムに対して、以下の修正をしてください。
  学生クラスに、教科書のゲッターとセッターを追加
  メインクラスで、学生ごとに教科書のセッターを使って教科書を設定
    山田：よく分かる漢文：国語
    田中：厳選問題集：数学
    鈴木：日本地図帳：社会

コンパイル方法
================
>>> javac SO302_Ex02_Q4_4.java
================

実行例
================
>>> java SO302_Ex02_Q4_4
私の名前は山田です。
A高校の1年生で、野球部に入っています。
私の好きな教科は国語です。
タイトル：よく分かる漢文
教科：国語

私の名前は田中です。
A高校の2年生で、テニス部に入っています。
私の好きな教科は数学です。
タイトル：厳選問題集
教科：数学

私の名前は鈴木です。
A高校の3年生で、吹奏楽部に入っています。
私の好きな教科は社会です。
タイトル：日本地図帳
教科：社会

================

*/


// ここより下に解答を記載する。
