/**
プログラミング実践Java
オブジェクト指向
練習問題8_2 抽象クラス
練習問題8_1のプログラムに対して、以下の修正をしてください。
  学生クラスと教師クラスを抽象化した人間クラスを作成
    属性
      高校 ※クラスフィールド
      名前
    メソッド
      コンストラクタ（引数：名前）
      自己紹介をする ※抽象メソッド

コンパイル方法
================
>>> javac SO302_Ex02_Q8_2.java
================

実行例
================
>>> java SO302_Ex02_Q8_2
私の名前は山田です。
A高校の1年生で、野球部に入っています。
私の好きな教科は国語です。
タイトル：よく分かる漢文
教科：国語

私の名前は田中です。
A高校の2年生で、テニス部に入っています。
私の好きな教科は数学です。
タイトル：厳選問題集
教科：数学

私の名前は鈴木です。
A高校の3年生で、吹奏楽部に入っています。
私の好きな教科は社会です。
タイトル：日本地図帳
教科：社会

私の名前は中野です。
A高校の2年生で、サッカー部に入っています。
私の好きな教科は理科です。
タイトル：物理学入門
教科：理科
学級委員長を務めています。

私の名前は野村です。
A高校で英語を担当しています。
勤務年数は6年です。

英語の授業をします。

================

*/


// ここより下に解答を記載する。
