/**
プログラミング実践Java
オブジェクト指向
練習問題4_2 委譲を使わずに教科書の情報を表示
練習問題4_1のプログラムに対して、以下の修正をしてください。
  教科書クラスを作成
    属性
      タイトル
      教科
    メソッド
      コンストラクタ（引数：タイトル、教科）
      タイトルのゲッターとセッター
      教科のゲッターとセッター
  学生クラスの属性に教科書を追加し、コンストラクタで初期化する※全員同じ教科書
    タイトル：よく分かる漢文
    教科：国語
  学生の自己紹介に教科書の情報を表示する※教科書の情報は、教科書のゲッターを使って取得する

コンパイル方法
================
>>> javac SO302_Ex02_Q4_2.java
================

実行例
================
>>> java SO302_Ex02_Q4_2
私の名前は山田です。
A高校の1年生で、野球部に入っています。
私の好きな教科は国語です。
タイトル：よく分かる漢文
教科：国語

私の名前は田中です。
A高校の2年生で、テニス部に入っています。
私の好きな教科は数学です。
タイトル：よく分かる漢文
教科：国語

私の名前は鈴木です。
A高校の3年生で、吹奏楽部に入っています。
私の好きな教科は社会です。
タイトル：よく分かる漢文
教科：国語

================

*/


// ここより下に解答を記載する。
