/**
プログラミング実践Java
オブジェクト指向
練習問題3_1 コンストラクタ
練習問題2_1のプログラムに対して、以下の修正をしてください。
  引数なしのコンストラクタを追加
  名前と学年だけを引数に取るコンストラクタを追加
  インスタンス生成時の引数を変更
    山田：引数なし
    田中：名前、学年
    鈴木：名前、部活動、好きな教科、学年※変更なし

コンパイル方法
================
>>> javac SO302_Ex02_Q3_1.java
================

実行例
================
>>> java SO302_Ex02_Q3_1
私の名前はnullです。
A高校の0年生で、nullに入っています。
私の好きな教科はnullです。

私の名前は田中です。
A高校の2年生で、nullに入っています。
私の好きな教科はnullです。

私の名前は鈴木です。
A高校の3年生で、吹奏楽部に入っています。
私の好きな教科は社会です。

私の名前はnullです。
B高校の2年生で、nullに入っています。
私の好きな教科はnullです。

私の名前は田中です。
B高校の2年生で、サッカー部に入っています。
私の好きな教科はnullです。

私の名前は鈴木です。
B高校の3年生で、吹奏楽部に入っています。
私の好きな教科は理科です。

================

*/


// ここより下に解答を記載する。
