/**
プログラミング実践Java
オブジェクト指向
練習問題4_3 委譲を使って教科書の情報を表示
練習問題4_2のプログラムに対して、以下の修正をしてください。
  教科書クラスに、教科書の情報を表示するメソッドを追加
  学生の自己紹介に教科書の情報を表示する※教科書の情報は、教科書のメソッドを使って取得する

コンパイル方法
================
>>> javac SO302_Ex02_Q4_3.java
================

実行例
================
>>> java SO302_Ex02_Q4_3
私の名前は山田です。
A高校の1年生で、野球部に入っています。
私の好きな教科は国語です。
タイトル：よく分かる漢文
教科：国語

私の名前は田中です。
A高校の2年生で、テニス部に入っています。
私の好きな教科は数学です。
タイトル：よく分かる漢文
教科：国語

私の名前は鈴木です。
A高校の3年生で、吹奏楽部に入っています。
私の好きな教科は社会です。
タイトル：よく分かる漢文
教科：国語

================

*/


// ここより下に解答を記載する。
