/**
プログラミング実践Java
オブジェクト指向
練習問題2_1 カプセル化 - ゲッターとセッター
練習問題11_5_4のプログラムに対して、以下の修正をしてください。
  すべての属性のゲッターとセッターを追加
  2回目の自己紹介の前に学生の情報を変更
    山田：1年生→2年生
    田中：テニス部→サッカー部
    鈴木：社会→理科

コンパイル方法
================
>>> javac SO302_Ex02_Q2_1.java
================

実行例
================
>>> java SO302_Ex02_Q2_1
私の名前は山田です。
A高校の1年生で、野球部に入っています。
私の好きな教科は国語です。

私の名前は田中です。
A高校の2年生で、テニス部に入っています。
私の好きな教科は数学です。

私の名前は鈴木です。
A高校の3年生で、吹奏楽部に入っています。
私の好きな教科は社会です。

私の名前は山田です。
B高校の2年生で、野球部に入っています。
私の好きな教科は国語です。

私の名前は田中です。
B高校の2年生で、サッカー部に入っています。
私の好きな教科は数学です。

私の名前は鈴木です。
B高校の3年生で、吹奏楽部に入っています。
私の好きな教科は理科です。

================

*/


// ここより下に解答を記載する。
