/**
プログラミング実践Java
オブジェクト指向
練習問題5_1 継承を使わずに学級委員クラスを作成
練習問題4_4のプログラムに対して、以下の修正をしてください。
  学級委員クラスを作成※継承は使わず、学生の特性に加えて、役職を追加
    属性
      役職
    メソッド
      コンストラクタ（引数：名前、学年、部活動、好きな教科、役職）
      役職のゲッターとセッター
  以下の学級委員を追加して、自己紹介する
    中野：サッカー部：理科：2年生：学級委員長：物理学入門：理科

コンパイル方法
================
>>> javac SO302_Ex02_Q5_1.java
================

実行例
================
>>> java SO302_Ex02_Q5_1
私の名前は山田です。
A高校の1年生で、野球部に入っています。
私の好きな教科は国語です。
タイトル：よく分かる漢文
教科：国語

私の名前は田中です。
A高校の2年生で、テニス部に入っています。
私の好きな教科は数学です。
タイトル：厳選問題集
教科：数学

私の名前は鈴木です。
A高校の3年生で、吹奏楽部に入っています。
私の好きな教科は社会です。
タイトル：日本地図帳
教科：社会

私の名前は中野です。
A高校の2年生で、サッカー部に入っています。
私の好きな教科は理科です。
タイトル：物理学入門
教科：理科

================

*/


// ここより下に解答を記載する。
