/**
プログラミング基礎Java
プログラミング演習
問題5
コマンドライン引数で入力された2つの数の最大公約数を求めてください。

コンパイル方法
================
>>> javac SO202_09_05.java
================

実行例
================
>>> java SO202_09_05
コマンドライン引数が不正です。
================
>>> java SO202_09_05 24
コマンドライン引数が不正です。
================
>>> java SO202_09_05 24 b
コマンドライン引数が不正です。
================
>>> java SO202_09_05 a 36
コマンドライン引数が不正です。
================
>>> java SO202_09_05 a b
コマンドライン引数が不正です。
================
>>> java SO202_09_05 24 36
12
================
>>> java SO202_09_05 24 37
1
================
>>> java SO202_09_05 24 24
24
================

*/


// ここより下に解答を記載する。
