/**
プログラミング基礎Java
プログラミング演習
問題9
1970年1月1日にコマンドライン引数で入力された日数を足した年月日を計算してください。

コンパイル方法
================
>>> javac SO202_09_10.java
================

実行例
================
>>> java SO202_09_10
コマンドライン引数が不正です。
================
>>> java SO202_09_10 0
1970年1月1日
================
>>> java SO202_09_10 1
1970年1月2日
================
>>> java SO202_09_10 31
1970年2月1日
================
>>> java SO202_09_10 364
1970年12月31日
================
>>> java SO202_09_10 2000
1975年6月24日
================
>>> java SO202_09_10 12345
2003年10月20日
================

*/


// ここより下に解答を記載する。
