/**
プログラミング基礎Java
プログラミング演習
問題7
コマンドライン引数で入力された数が素数かどうかを判定してください。
※素数とは、1とその数自身以外の約数を持たない数のことです。

コンパイル方法
================
>>> javac SO202_09_07.java
================

実行例
================
>>> java SO202_09_07
コマンドライン引数が不正です。
================
>>> java SO202_09_07 a
コマンドライン引数が不正です。
================
>>> java SO202_09_07 1
1は素数ではありません。
================
>>> java SO202_09_07 2
2は素数です。
================
>>> java SO202_09_07 3
3は素数です。
================
>>> java SO202_09_07 4
4は素数ではありません。
================
>>> java SO202_09_07 5
5は素数です。
================
>>> java SO202_09_07 6
6は素数ではありません。
================
>>> java SO202_09_07 7
7は素数です。
================
>>> java SO202_09_07 8
8は素数ではありません。
================
>>> java SO202_09_07 9
9は素数ではありません。
================
>>> java SO202_09_07 10
10は素数ではありません。
================
>>> java SO202_09_07 11
11は素数です。
================

*/


// ここより下に解答を記載する。
