/**
プログラミング基礎Java
プログラミング演習
問題9
1970年1月1日からコマンドライン引数で入力された年月日までの経過日数を計算してください。

コンパイル方法
================
>>> javac SO202_09_09.java
================

実行例
================
>>> java SO202_09_09
コマンドライン引数が不正です。
================
>>> java SO202_09_09 1970 1 1
0日
================
>>> java SO202_09_09 1970 1 2
1日
================
>>> java SO202_09_09 1970 2 1
31日
================
>>> java SO202_09_09 1970 12 31
364日
================
>>> java SO202_09_09 1975 6 24
2000日
================
>>> java SO202_09_09 2003 10 20 
12345日
================

*/


// ここより下に解答を記載する。
