/**
プログラミング基礎Java
プログラミング演習
問題6
コマンドライン引数で入力された2つの数の最小公倍数を求めてください。

コンパイル方法
================
>>> javac SO202_09_06.java
================

実行例
================
>>> java SO202_09_06
コマンドライン引数が不正です。
================
>>> java SO202_09_06 24
コマンドライン引数が不正です。
================
>>> java SO202_09_06 24 b
コマンドライン引数が不正です。
================
>>> java SO202_09_06 a 36
コマンドライン引数が不正です。
================
>>> java SO202_09_06 a b
コマンドライン引数が不正です。
================
>>> java SO202_09_06 24 36
72
================
>>> java SO202_09_06 24 37
888
================
>>> java SO202_09_06 24 24
24
================

*/


// ここより下に解答を記載する。
