/**
プログラミング実践Java
オブジェクト指向
演習課題 問3-5

コンパイル方法
================
>>> javac SO302_Ex03.java
================

実行例
================
>>> java SO302_Ex03 < SO302_Ex03_input.txt
C-VM-0001の電源を入れました。

書店情報
  書店名  ：B書店
  住所    ：東京都中央区1-2-3
  電話番号：03-1234-5678

顧客情報
  顧客ID  ：B-BS-0001
  氏名    ：渡辺花子
  年齢層  ：20代
  性別    ：女

1 書籍情報
  書名    ：Java入門
  価格    ：2000円
  著者    ：山田太郎
  出版社  ：C出版

2 書籍情報
  書名    ：Java実践
  価格    ：2200円
  著者    ：山田太郎
  出版社  ：C出版

3 書籍情報
  書名    ：マンガで分かるJava（1巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

4 書籍情報
  書名    ：マンガで分かるJava（2巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

5 書籍情報
  書名    ：マンガで分かるJava（3巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

6 書籍情報
  書名    ：Javaマガジン
  価格    ：1000円
  著者    ：佐藤次郎
  出版社  ：Eブックス
  ジャンル：趣味
  発売日  ：2021/12/24

7 書籍情報
  書名    ：Javaマガジン
  価格    ：1000円
  著者    ：佐藤次郎
  出版社  ：Eブックス
  ジャンル：趣味
  発売日  ：2022/03/24

8 雑貨情報
  名称    ：ボールペン
  価格    ：120円
  種別    ：文房具

9 雑貨情報
  名称    ：クッション
  価格    ：2800円
  種別    ：インテリア

自動販売機情報
  識別番号    ：C-VM-0001
  メーカー    ：Cビバレッジ
  電力モード  ：オン
  ○ 1  500ml Cold 160円 コーラ
  ○ 2  350ml Cold 120円 オレンジジュース
  ○ 3  500ml Cold 140円 烏龍茶
  ○ 4  500ml Cold 100円 ミネラルウォーター
  ○ 5  280ml Hot  120円 コーヒー

商品番号を入力してください。＞
8 雑貨情報
  名称    ：ボールペン
  価格    ：120円
  種別    ：文房具

商品番号を入力してください。＞
    3  500ml Cold 140円 烏龍茶

C-VM-0001の電源を切りました。

書店情報
  書店名  ：B書店
  住所    ：東京都中央区1-2-3
  電話番号：03-1234-5678

顧客情報
  顧客ID  ：B-BS-0001
  氏名    ：渡辺花子
  年齢層  ：20代
  性別    ：女

1 書籍情報
  書名    ：Java入門
  価格    ：2000円
  著者    ：山田太郎
  出版社  ：C出版

2 書籍情報
  書名    ：Java実践
  価格    ：2200円
  著者    ：山田太郎
  出版社  ：C出版

3 書籍情報
  書名    ：マンガで分かるJava（1巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

4 書籍情報
  書名    ：マンガで分かるJava（2巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

5 書籍情報
  書名    ：マンガで分かるJava（3巻）
  価格    ：500円
  著者    ：田中一郎
  出版社  ：D書房

6 書籍情報
  書名    ：Javaマガジン
  価格    ：1000円
  著者    ：佐藤次郎
  出版社  ：Eブックス
  ジャンル：趣味
  発売日  ：2021/12/24

7 書籍情報
  書名    ：Javaマガジン
  価格    ：1000円
  著者    ：佐藤次郎
  出版社  ：Eブックス
  ジャンル：趣味
  発売日  ：2022/03/24

8 雑貨情報
  名称    ：クッション
  価格    ：2800円
  種別    ：インテリア

自動販売機情報
  識別番号    ：C-VM-0001
  メーカー    ：Cビバレッジ
  電力モード  ：オフ
  ○ 1  500ml Cold 160円 コーラ
  ○ 2  350ml Cold 120円 オレンジジュース
  × 3  500ml Cold 140円 烏龍茶
  ○ 4  500ml Cold 100円 ミネラルウォーター
  ○ 5  280ml Hot  120円 コーヒー

================

*/


// ここより下に解答を記載する。
