/**
プログラミング基礎Java
EX01 JAVA [完全]入門
Chapter07 問題20

問題19のプログラムを改造して、行ごとに要素の異なるジャグ配列を生成し、各要素に九九の値を代入した後に、
各要素を出力するプログラムを書いてください。1行目の要素数は1個、2行目の要素数は2個…のように、
行番号と要素数を一致させることで、左下だけの九九の表を作成します。

コンパイル方法
================
>>> java -jar checkstyle-10.3.4-all.jar -c checkstyle.xml SO202_EX01_07_20.java
Starting audit...
Audit done.
>>> javac SO202_EX01_07_20.java
================

実行例
================
>>> java SO202_EX01_07_20
 1 
 2  4 
 3  6  9 
 4  8 12 16 
 5 10 15 20 25 
 6 12 18 24 30 36 
 7 14 21 28 35 42 49 
 8 16 24 32 40 48 56 64 
 9 18 27 36 45 54 63 72 81 
================

*/


// ここより下に解答を記載する。
