/**
プログラミング基礎Java
EX01 JAVA [完全]入門
Chapter06 問題09 (改)

for文の無限ループを使用して、0以上の整数を30まで出力するプログラムを書いてください。
30まで出力したら、break文でfor文を抜けて終了してください。
break文については、Chapter 6 Section 4を参照してください。

コンパイル方法
================
>>> java -jar checkstyle-10.3.4-all.jar -c checkstyle.xml SO202_EX01_06_09.java
Starting audit...
Audit done.
>>> javac SO202_EX01_06_09.java
================

実行例
================
>>> java SO202_EX01_06_09
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
================

*/


// ここより下に解答を記載する。
