/**
プログラミング基礎Java
EX01 JAVA [完全]入門
Chapter06 問題05

0から9までの整数に対する平方根を出力するプログラムを書いてください。
Math.sqrt(Chapter3)を使います。

コンパイル方法
================
>>> java -jar checkstyle-10.3.4-all.jar -c checkstyle.xml SO202_EX01_06_05.java
Starting audit...
Audit done.
>>> javac SO202_EX01_06_05.java
================

実行例
================
>>> java SO202_EX01_06_05
0.0
1.0
1.4142135623730951
1.7320508075688772
2.0
2.23606797749979
2.449489742783178
2.6457513110645907
2.8284271247461903
3.0
================

*/


// ここより下に解答を記載する。
